<template>
  <div>
    <base-header class="pb-4 pt-0 pt-sm-3 pt-md-7 pt-lg-8 pt-xl-8 bg-gray">
       <b-row>
         <div class="h1 text-white m-3">Все новости</div>
       </b-row>
    </base-header>

    <b-container fluid class="pills-news">
        <b-row class="justify-content-center">
            <div>
                <b-tabs pills>
                    <b-tab active>
                        <template v-slot:title :class="{'meme': true}">
                             <span class="">Все</span>
                        </template>
                        <div class="container">
                            <div class="row my-4">
                                <div class="mt-3 col-12 col-sm-12 col-md-12 col-xl-6 col-lg-6" v-for="news in all" :key="news.id">
                                    <NewsCard 
                                    :title='news.title' 
                                    :img='news.img'
                                    :content='news.content'
                                    :type='news.type'
                                    :data='news.data'
                                    ></NewsCard>
                                </div>
                                <base-button block type="primary">Загрузить еще</base-button>
                            </div>
                        </div>
                    </b-tab>

                    <b-tab>
                        <template v-slot:title>
                             <span class="">Колледж</span>
                        </template>
                        <div class="container">
                            <div class="row my-4">
                                <div class="mt-3 col-12 col-sm-12 col-md-12 col-xl-6 col-lg-6" v-for="news in colledge" :key="news.id">
                                    <NewsCard 
                                    :title='news.title' 
                                    :img='news.img'
                                    :content='news.content'
                                    :type='news.type'
                                    :data='news.data'
                                    ></NewsCard>
                                </div>
                                <base-button block type="primary">Загрузить еще</base-button>
                            </div>
                        </div>
                    </b-tab>

                    <b-tab>
                        <template v-slot:title>
                            Универ
                        </template>
                        <div class="container">
                            <div class="row my-4">
                                <div class="mt-3 col-12 col-sm-12 col-md-12 col-xl-6 col-lg-6" v-for="news in univer" :key="news.id">
                                    <NewsCard 
                                    :title='news.title' 
                                    :img='news.img'
                                    :content='news.content'
                                    :type='news.type'
                                    :data='news.data'
                                    ></NewsCard>
                                </div>
                                <base-button block type="primary">Загрузить еще</base-button>
                            </div>
                        </div>
                    </b-tab>
                </b-tabs>
            </div>
        </b-row>
    </b-container>
  </div>
</template>
<script>

  export default {
    name: 'AllNews',
    components: {
    },
    data() {
      return {
          all: [
              {
                    title: "Отбор в военный учебный центр",
                    img: 'http://sut.ru/new_site/images/news/1601385092.jpg',
                    content: [{
                        text: [
                            'С 1 октября 2020 года начинается отбор студентов в военный учебный центр (ВУЦ) при СПбГУТ для обучения по программам запаса!'
                            ]
                    }],
                    type: 'Образование',
                    data: '29.09.2020'
                },
                {
                    title: "Сотруднику СПбГУТ вручено благодарственное письмо от Министра спорта РФ",
                    img: 'http://sut.ru/new_site/images/news/1601372557.jpg',
                    content: [{
                        text: [
                            'На торжественной церемонии Всероссийского финала Всероссийских соревнований по мини-футболу среди студентов в Нижегородской области специалисту по спортивно-массовой работе УВСР Виктору Сергеевичу Паку за развитие физической культуры и спорта и в связи с 15-летием Общероссийского проекта «Мини-футбол в ВУЗы» вручено благодарственное письмо от Министра спорта Российской Федерации.'
                            ]
                    }],
                    type: 'Спорт',
                    data: '29.09.2020'
                },
                {
                    title: "Акция по сбору макулатуры в СПбГУТ",
                    img: 'http://sut.ru/new_site/images/news/1601370382.jpg',
                    content: [{
                        text: [
                            'Кафедра экологической безопасности телекоммуникаций (факультет РТС) проводит экологическую акцию по сбору макулатуры!'
                            ]
                    }],
                    type: 'Общественная жизнь',
                    data: '29.09.2020'
                },
                {
                    title: "«Погоня за осенью» от ССК «Бончевские тигры»",
                    img: 'http://sut.ru/new_site/images/news/1601297242.jpg',
                    content: [{
                        text: [
                            'В воскресенье, 27 сентября, в Парке Победы состоялось традиционное мероприятие от ССК «Бончевские тигры»   ­­̶ соревнования среди студентов университета по бегу «Погоня за осенью».'
                            ]
                    }],
                    type: 'Спорт',
                    data: '29.09.2020'
                },
                {
                    title: "О проведении комплексной проверки систем оповещения",
                    img: 'http://sut.ru/new_site/images/news/1601297858.jpg',
                    content: [{
                        text: [
                            'Уважаемые работники и студенты! Информируем вас о том, что 2 октября с 11:30 до 11:41 планируется проведение комплексной технической проверки готовности региональной автоматизированной системы централизованного оповещения (РАСЦО) с включением оконечных средств оповещения и доведением проверочных сигналов и информации оповещения до населения.'
                            ]
                    }],
                    type: 'Управление',
                    data: '29.09.2020'
                },
              {
                    title: "Торжественная церемония открытия чемпионата по стандартам WorldSkills «BonchSkills – 2020»",
                    img: 'none',
                    content: [{
                        text: [
                            'Сегодня, 22 сентября, в 16.00 состоится церемония открытия IV Открытого чемпионата Санкт-Петербургского государственного университета телекоммуникаций им. проф. М.А. Бонч-Бруевича по стандартам WorldSkills «BonchSkills – 2020»',
                            'Чемпионат «BonchSkills – 2020» проводится в дистанционно-очном формате с 22 сентября по 1 октября на площадках Санкт-Петербургского государственного университета телекоммуникаций им. проф. М.А. Бонч-Бруевича и Санкт-Петербургского колледжа телекоммуникаций.',
                            'Победители примут участие в Национальном межвузовском чемпионате по стандартам WorldSkills в Москве.'
                            ]
                    }],
                    type: 'Управление',
                    data: '22.09.2020'
                },
                {
                    title: "Информация о замене и получении банковских карт",
                    img: 'http://www.sut.ru/images/news_images/6340/6659319868635.jpg',
                    content: [{
                        text: [
                            'Вниманию студентов всех курсов! Старшекурсникам, у которых закончился срок действия банковских карт, и неполучившим ранее банковские карты превокурсникам, необходимо получить новые карты 14 сентября 2020 года с 11.00 до 16.00 в актовом зале колледжа. При себе обязательно иметь паспорт.'
                            ]
                    }],
                    type: 'Объявления',
                    data: '11.09.2020'
                },
                {
                    title: "День памяти жертв блокады Ленинграда",
                    img: 'http://www.sut.ru/images/news_images/6368/121063541878440.jpg',
                    content: [{
                        text: [
                            '8 сентября – День памяти жертв блокады Ленинграда. Это скорбная дата ленинградской истории. В этот день, 8 сентября 1941 года, замкнулось вражеское кольцо, начался отсчет 900 дней и ночей обороны Ленинграда, потрясшей весь мир своей трагедией и героизмом.'
                            ]
                    }],
                    type: 'Без темы',
                    data: '08.09.2020'
                },
                {
                    title: "Оформление льготных проездных билетов (БСК)",
                    img: 'http://www.sut.ru/images/news_images/6363/117439958464164.jpg',
                    content: [{
                        text: [
                            'Право на проезд по льготным тарифам имеют студенты и аспиранты очной формы обучения. Данный вид проездного билета называется бесконтактная смарт-карта (БСК), на которой размещены ваши ФИО и фотография.'
                            ]
                    }],
                    type: 'Объявления',
                    data: '08.09.2020'
                },
                {
                    title: "Прививки от гриппа",
                    img: 'https://www.sut.ru/news/data/textimages8/5c26aab49a4a45139e08b578c1a1f888.jpg',
                    content: [{
                        text: [
                            '11 сентября 2020 года с 11.00 до 14.00 в колледже будет проходить вакцинация от гриппа'
                            ]
                    }],
                    type: 'Объявления',
                    data: '07.09.2020'
                },
                {
                    title: "Вниманию студентов!",
                    img: 'http://www.sut.ru/images/news_images/5927/105383344472380.jpg',
                    content: [{
                        text: [
                            'Напоминаем вам, что в связи с текущей эпидемиологической обстановкой вход в колледж осуществляется только в масках. Замена масок должна быть каждые 3 часа. Новую маску можно получить в каб. 427 или 294.'
                            ]
                    }],
                    type: 'Объявления',
                    data: '03.09.2020'
                }
              ],
          colledge: [
                {
                    title: "Торжественная церемония открытия чемпионата по стандартам WorldSkills «BonchSkills – 2020»",
                    img: 'none',
                    content: [{
                        text: [
                            'Сегодня, 22 сентября, в 16.00 состоится церемония открытия IV Открытого чемпионата Санкт-Петербургского государственного университета телекоммуникаций им. проф. М.А. Бонч-Бруевича по стандартам WorldSkills «BonchSkills – 2020»',
                            'Чемпионат «BonchSkills – 2020» проводится в дистанционно-очном формате с 22 сентября по 1 октября на площадках Санкт-Петербургского государственного университета телекоммуникаций им. проф. М.А. Бонч-Бруевича и Санкт-Петербургского колледжа телекоммуникаций.',
                            'Победители примут участие в Национальном межвузовском чемпионате по стандартам WorldSkills в Москве.'
                            ]
                    }],
                    type: 'Управление',
                    data: '22.09.2020'
                },
                {
                    title: "Информация о замене и получении банковских карт",
                    img: 'http://www.sut.ru/images/news_images/6340/6659319868635.jpg',
                    content: [{
                        text: [
                            'Вниманию студентов всех курсов! Старшекурсникам, у которых закончился срок действия банковских карт, и неполучившим ранее банковские карты превокурсникам, необходимо получить новые карты 14 сентября 2020 года с 11.00 до 16.00 в актовом зале колледжа. При себе обязательно иметь паспорт.'
                            ]
                    }],
                    type: 'Объявления',
                    data: '11.09.2020'
                },
                {
                    title: "День памяти жертв блокады Ленинграда",
                    img: 'http://www.sut.ru/images/news_images/6368/121063541878440.jpg',
                    content: [{
                        text: [
                            '8 сентября – День памяти жертв блокады Ленинграда. Это скорбная дата ленинградской истории. В этот день, 8 сентября 1941 года, замкнулось вражеское кольцо, начался отсчет 900 дней и ночей обороны Ленинграда, потрясшей весь мир своей трагедией и героизмом.'
                            ]
                    }],
                    type: 'Без темы',
                    data: '08.09.2020'
                },
                {
                    title: "Оформление льготных проездных билетов (БСК)",
                    img: 'http://www.sut.ru/images/news_images/6363/117439958464164.jpg',
                    content: [{
                        text: [
                            'Право на проезд по льготным тарифам имеют студенты и аспиранты очной формы обучения. Данный вид проездного билета называется бесконтактная смарт-карта (БСК), на которой размещены ваши ФИО и фотография.'
                            ]
                    }],
                    type: 'Объявления',
                    data: '08.09.2020'
                },
                {
                    title: "Прививки от гриппа",
                    img: 'https://www.sut.ru/news/data/textimages8/5c26aab49a4a45139e08b578c1a1f888.jpg',
                    content: [{
                        text: [
                            '11 сентября 2020 года с 11.00 до 14.00 в колледже будет проходить вакцинация от гриппа'
                            ]
                    }],
                    type: 'Объявления',
                    data: '07.09.2020'
                },
                {
                    title: "Вниманию студентов!",
                    img: 'http://www.sut.ru/images/news_images/5927/105383344472380.jpg',
                    content: [{
                        text: [
                            'Напоминаем вам, что в связи с текущей эпидемиологической обстановкой вход в колледж осуществляется только в масках. Замена масок должна быть каждые 3 часа. Новую маску можно получить в каб. 427 или 294.'
                            ]
                    }],
                    type: 'Объявления',
                    data: '03.09.2020'
                }
              ],
          univer: [
              {
                    title: "Отбор в военный учебный центр",
                    img: 'http://sut.ru/new_site/images/news/1601385092.jpg',
                    content: [{
                        text: [
                            'С 1 октября 2020 года начинается отбор студентов в военный учебный центр (ВУЦ) при СПбГУТ для обучения по программам запаса!'
                            ]
                    }],
                    type: 'Образование',
                    data: '29.09.2020'
                },
                {
                    title: "Сотруднику СПбГУТ вручено благодарственное письмо от Министра спорта РФ",
                    img: 'http://sut.ru/new_site/images/news/1601372557.jpg',
                    content: [{
                        text: [
                            'На торжественной церемонии Всероссийского финала Всероссийских соревнований по мини-футболу среди студентов в Нижегородской области специалисту по спортивно-массовой работе УВСР Виктору Сергеевичу Паку за развитие физической культуры и спорта и в связи с 15-летием Общероссийского проекта «Мини-футбол в ВУЗы» вручено благодарственное письмо от Министра спорта Российской Федерации.'
                            ]
                    }],
                    type: 'Спорт',
                    data: '29.09.2020'
                },
                {
                    title: "Акция по сбору макулатуры в СПбГУТ",
                    img: 'http://sut.ru/new_site/images/news/1601370382.jpg',
                    content: [{
                        text: [
                            'Кафедра экологической безопасности телекоммуникаций (факультет РТС) проводит экологическую акцию по сбору макулатуры!'
                            ]
                    }],
                    type: 'Общественная жизнь',
                    data: '29.09.2020'
                },
                {
                    title: "«Погоня за осенью» от ССК «Бончевские тигры»",
                    img: 'http://sut.ru/new_site/images/news/1601297242.jpg',
                    content: [{
                        text: [
                            'В воскресенье, 27 сентября, в Парке Победы состоялось традиционное мероприятие от ССК «Бончевские тигры»   ­­̶ соревнования среди студентов университета по бегу «Погоня за осенью».'
                            ]
                    }],
                    type: 'Спорт',
                    data: '29.09.2020'
                },
                {
                    title: "О проведении комплексной проверки систем оповещения",
                    img: 'http://sut.ru/new_site/images/news/1601297858.jpg',
                    content: [{
                        text: [
                            'Уважаемые работники и студенты! Информируем вас о том, что 2 октября с 11:30 до 11:41 планируется проведение комплексной технической проверки готовности региональной автоматизированной системы централизованного оповещения (РАСЦО) с включением оконечных средств оповещения и доведением проверочных сигналов и информации оповещения до населения.'
                            ]
                    }],
                    type: 'Управление',
                    data: '29.09.2020'
                },
              ]
      };
    }
  };
</script>
<style>
.pills-news .nav-pills{
    display: flex !important;
    flex-flow: row nowrap !important;
    margin: 0 15px 0 15px;
}
.pills-news .nav-item{
    margin: 0 5px 0 5px;
    width: 100%;
    
}
.pills-news .nav-item:first{
    margin: 0 5px;
}

</style>
