<template>
  <div class="container">
        <div class="row news my-4">
            <div class="col-12 col-sm-12 col-md-12 col-xl-6 col-lg-6" v-for="news in news" :key="news.id">
                <NewsCard 
                 :title='news.title' 
                 :img='news.img'
                 :content='news.content'
                 :type='news.type'
                 :data='news.data'
                 ></NewsCard>
            </div>
            <base-button block type="primary">Загрузить еще</base-button>
        </div>
    </div>
</template>

<script>

import NewsCard from '@/components/News/NewsCard'

export default {
    name: "News",
    data () {
        return {
            news: [
                {
                    title: "Торжественная церемония открытия чемпионата по стандартам WorldSkills «BonchSkills – 2020»",
                    img: 'none',
                    content: [{
                        text: [
                            'Сегодня, 22 сентября, в 16.00 состоится церемония открытия IV Открытого чемпионата Санкт-Петербургского государственного университета телекоммуникаций им. проф. М.А. Бонч-Бруевича по стандартам WorldSkills «BonchSkills – 2020»',
                            'Чемпионат «BonchSkills – 2020» проводится в дистанционно-очном формате с 22 сентября по 1 октября на площадках Санкт-Петербургского государственного университета телекоммуникаций им. проф. М.А. Бонч-Бруевича и Санкт-Петербургского колледжа телекоммуникаций.',
                            'Победители примут участие в Национальном межвузовском чемпионате по стандартам WorldSkills в Москве.'
                            ]
                    }],
                    type: 'Управление',
                    data: '22.09.2020'
                },
                {
                    title: "Информация о замене и получении банковских карт",
                    img: 'http://www.sut.ru/images/news_images/6340/6659319868635.jpg',
                    content: [{
                        text: [
                            'Вниманию студентов всех курсов! Старшекурсникам, у которых закончился срок действия банковских карт, и неполучившим ранее банковские карты превокурсникам, необходимо получить новые карты 14 сентября 2020 года с 11.00 до 16.00 в актовом зале колледжа. При себе обязательно иметь паспорт.'
                            ]
                    }],
                    type: 'Объявления',
                    data: '11.09.2020'
                },
                {
                    title: "День памяти жертв блокады Ленинграда",
                    img: 'http://www.sut.ru/images/news_images/6368/121063541878440.jpg',
                    content: [{
                        text: [
                            '8 сентября – День памяти жертв блокады Ленинграда. Это скорбная дата ленинградской истории. В этот день, 8 сентября 1941 года, замкнулось вражеское кольцо, начался отсчет 900 дней и ночей обороны Ленинграда, потрясшей весь мир своей трагедией и героизмом.'
                            ]
                    }],
                    type: 'Без темы',
                    data: '08.09.2020'
                },
                {
                    title: "Оформление льготных проездных билетов (БСК)",
                    img: 'http://www.sut.ru/images/news_images/6363/117439958464164.jpg',
                    content: [{
                        text: [
                            'Право на проезд по льготным тарифам имеют студенты и аспиранты очной формы обучения. Данный вид проездного билета называется бесконтактная смарт-карта (БСК), на которой размещены ваши ФИО и фотография.'
                            ]
                    }],
                    type: 'Объявления',
                    data: '08.09.2020'
                },
                {
                    title: "Прививки от гриппа",
                    img: 'https://www.sut.ru/news/data/textimages8/5c26aab49a4a45139e08b578c1a1f888.jpg',
                    content: [{
                        text: [
                            '11 сентября 2020 года с 11.00 до 14.00 в колледже будет проходить вакцинация от гриппа'
                            ]
                    }],
                    type: 'Объявления',
                    data: '07.09.2020'
                },
                {
                    title: "Вниманию студентов!",
                    img: 'http://www.sut.ru/images/news_images/5927/105383344472380.jpg',
                    content: [{
                        text: [
                            'Напоминаем вам, что в связи с текущей эпидемиологической обстановкой вход в колледж осуществляется только в масках. Замена масок должна быть каждые 3 часа. Новую маску можно получить в каб. 427 или 294.'
                            ]
                    }],
                    type: 'Объявления',
                    data: '03.09.2020'
                },
            ]
            
        }
    }
}
</script>

<style>

</style>